In [334]:
import pandas as pd
dict = [{"name" : "Gaurav" , "rollno" : 's1' , "salary" : 1000 , "dept" : "comp"},
        {"name" : "Pratik" , "rollno" : 's2' , "salary" : 700,"dept" : "IT"},
        {"name" : "Sneha" , "rollno" : 's3' , "salary" : 600,"dept" : "comp"},
       {"name" : "Mayur" , "rollno" : 's4' , "salary" : 500,"dept" : "Mech"}
       ]

df = pd.DataFrame(dict) 

df

     name rollno  salary  dept
0  Gaurav     s1    1000  comp
1  Pratik     s2     700    IT
2   Sneha     s3     600  comp
3   Mayur     s4     500  Mech

In [335]:
#  column projection
# df["name"]
# df[["name","salary"]]

# # row selection using index labels 
# df.iloc[0]
# df.iloc[[0,1]]
# df= df.set_index('rollno')
# df

# df.loc['s1']
# df.loc[['s1','s2']]
# df.loc['s1':'s3']

# # row selection using a filter / where clause / filtering the dataset
# boolean_list = df['salary'] >599 # [True,True,True,False]
# df[boolean_list]

# boolean_list = df['salary'] >599 # [True,True,True,False]
# df.loc[boolean_list]
# df.query('salary>599')

# # row selection using a filter / where clause / filtering the dataset 
# # and also column projection 
# df[df['salary'] >599]["name"]
# df.loc[df['salary'] >599,"name"]
df.query('salary>599')["name"]

0    Gaurav
1    Pratik
2     Sneha
Name: name, dtype: object

In [336]:
# boolean_list = df['dept'].isin(["comp","IT"])
# df.loc[boolean_list,'name']

# df.query('dept in ("comp","IT")')['name']

In [337]:
#https://dataindependent.com/pandas/pandas-iterate-over-rows-5-methods/
# df['salary'] = df['salary']*.10 + df['salary']

def get_category(row):
    if  row['salary']> 999 :
        return "Overpaid"
    else:
        return "Underpaid" 
        
df['new_category'] = df.apply(get_category, axis = 1 )

df = df.set_index('rollno')
df

# extract digits 
# import re 
# pattern = '\d+'
# print(re.search(pattern,'s1').group(0))

# figure this out 
def roll_no_category(row):
    return 1
   
df["test"] = df.apply(roll_no_category,axis=0)
df

          name  salary  dept new_category  test
rollno
s1      Gaurav    1000  comp     Overpaid   NaN
s2      Pratik     700    IT    Underpaid   NaN
s3       Sneha     600  comp    Underpaid   NaN
s4       Mayur     500  Mech    Underpaid   NaN

In [278]:
int('s1'[-1])

1

In [241]:
import re 
pattern = '\d+'
df.apply(lambda row: print (f"{row['s1']} - {row['s2']}"), axis=0)

Gaurav - Pratik
1000 - 700
comp - IT
Overpaid - Underpaid

name            None
salary          None
dept            None
new_category    None
dtype: object